Autodesk.Navisworks.Api.ModelItemCollection.Item(System.Int32)
Gets the item at the specified index
index: The zero-based index of the item to get
Throws System.ArgumentOutOfRangeException:
index is not a valid index in the collection